trade_exp/src/InformationRegisters/ПроцентНаценкиРозница/ПроцентНаценкиРозница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aba14641-6aa7-40fc-94cc-399b84cd7c1f">
  <name>ПроцентНаценкиРозница</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="5f1bc3e1-3ba5-4efa-9f2a-db16be597d91">
    <name>ПроцентНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="4c9abfff-72bc-49c9-9c91-85965490a54b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8dc51270-4a5c-4ba1-9e45-ce92bde7b517">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="1ba35311-fbc3-4ed1-bcb4-b544e2ec53bc">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="f42f2ac0-a522-41d7-9359-717a9b991783">
    <name>ЦеноваяГруппа_Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b18e0fd0-671b-4a03-a82f-1e45a46ba48a">
    <name>Начало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="66dde80c-8967-454c-a470-dda3fbd5fc46">
    <name>Окончание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ПроцентНаценкиРозница/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПоЦеновойГруппе(Команда)
	
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиРозница.ФормаЗаписи",Новый Структура("ТипЗаписи",1));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_ЦеноваяГруппа(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_ЦеноваяГруппа", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_ЦеноваяГруппа());
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("ДополнительныйАлгоритм","ПроверкаРозничнойНаценкиЦеноваяГруппа"); 
	
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Номенклатура(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Номенклатура", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Номенклатура());
	ПараметрыФормы.Вставить("ДополнительныйАлгоритм","ПроверкаРозничнойНаценкиНоменклатура"); 
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПоНоменклатуре(Команда)
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиРозница.ФормаЗаписи",Новый Структура("ТипЗаписи",0));
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы_ЦеноваяГруппа()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.ЦеновыеГруппы#Ценовая группа#30#1#Справочники.ЦеновыеГруппы.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Номенклатура()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Начало", "Дата#Начало#10");
	СтруктураТаблицы.Вставить("Окончание", "Дата#Окончание#10");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Номенклатура(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_ЦеноваяГруппа(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиРозница.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=1;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокЦеноваяГруппа.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиРозница.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокНоменклатура.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ТекущаяДата",ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти
